<a href="https://colab.research.google.com/github/capitallatera/Minor_Projects/blob/master/covid19_in_punjab.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
# pip install bs4

In [1]:
# importing the BeautifulSoup Library
import bs4
import requests

In [2]:
res=requests.get("https://en.wikipedia.org/wiki/COVID-19_pandemic_in_Punjab,_India")

In [3]:
# Convert the request object to the Beautiful Soup Object
soup=bs4.BeautifulSoup(res.text,'html.parser')

In [4]:
data=[]
data_iterator=iter(soup.find_all('tr'))

In [5]:
while True:
    try:
        d_1=next(data_iterator).text
        
        data.append((
            d_1
        ))
    except StopIteration:
        break

In [6]:
jj=[]
for i in data:
    s=i.replace("\n\n",',')
    s=s.replace('\n','')
    jj.append([s])

In [7]:
for i,j in zip(jj,range(len(jj))):
    if i[0]=='COVID-19 pandemic in Punjab by Districts':
        print(i[0],j)
    if i[0]=='Date(2020),District,Cases,Deaths':
        print(i[0],j)

COVID-19 pandemic in Punjab by Districts 15
Date(2020),District,Cases,Deaths 41

In [8]:
llst=[]
for i,j in zip(jj,range(len(jj))):
    if j>=18 and j<40:
        llst.append([i[0]])

In [9]:
lst=[]
for j in range(len(llst)):
    ii=llst[j][0].split(',')
    lst.append(ii)

In [21]:
import csv
fields=['Districts','Active cases','Recovered','Deaths','Total cases','Tests']
lst
filename='covid19_punjab_dataset.csv'
with open(filename,'w') as csvfile:
    csvwriter=csv.writer(csvfile)
    csvwriter.writerow(fields)
    csvwriter.writerows(lst)

###  Reading the dataset

In [22]:
import pandas as pd

In [23]:
df=pd.read_csv('covid19_punjab_dataset.csv')
df.head(3)

  Districts Active cases  Recovered Deaths  Total cases  Tests
0  Amritsar          143        929     59         1131  32.9k
1   Barnala           13         64      2           79     9K
2  Bathinda           55         95      4          154    16K

In [ ]:
# # remove the parenthesis area
# s='a(12)b'
# import re
# re.sub(r" ?\([^)]+\)", "", s)

In [24]:
df.head(2)

  Districts Active cases  Recovered Deaths  Total cases  Tests
0  Amritsar          143        929     59         1131  32.9k
1   Barnala           13         64      2           79     9K

In [26]:
import re
df['Active cases']=df['Active cases'].apply(lambda x:re.sub(r" ?\([^)]+\)","", x))

In [28]:
# df['Recovered']=df['Recovered'].apply(lambda x:re.sub(r" ?\([^)]+\)", "", x))

In [29]:
df['Deaths']=df['Deaths'].apply(lambda x:re.sub(r" ?\([^)]+\)","", x))

In [30]:
df['Active cases']=df['Active cases'].map(lambda x: int(x))
df['Deaths']=df['Deaths'].map(lambda x: int(x))

In [35]:
# Top five cities have Maximum Deaths
df.sort_values('Deaths',ascending=False).head()

    Districts  Active cases  Recovered  Deaths  Total cases  Tests
0    Amritsar           143        929      59         1131  32.9k
11   Ludhiana           535       1011      35         1581  48.2K
9   Jalandhar           642        764      31         1437  30.1K
20    Sangrur           105        546      21          672  19.4K
18    Patiala           513        223      12          748  29.8K

In [36]:
# Top five cities have Maximum Active cases
df.sort_values('Active cases',ascending=False).head()

    Districts  Active cases  Recovered  Deaths  Total cases  Tests
9   Jalandhar           642        764      31         1437  30.1K
11   Ludhiana           535       1011      35         1581  48.2K
18    Patiala           513        223      12          748  29.8K
14     Mohali           156        290       9          455  15.4K
0    Amritsar           143        929      59         1131  32.9k

In [37]:
df.describe()

       Active cases    Recovered     Deaths  Total cases
count     22.000000    22.000000  22.000000    22.000000
mean     123.363636   266.681818  10.136364   400.045455
std      184.808407   281.212915  14.469329   440.850960
min       11.000000    51.000000   0.000000    64.000000
25%       25.500000   103.000000   2.000000   153.250000
50%       45.500000   143.500000   4.500000   198.500000
75%      102.750000   245.500000   9.000000   414.750000
max      642.000000  1011.000000  59.000000  1581.000000

In [41]:
# Average cases has increased by 123 earlier it was recorded 69
df['Active cases'].mean()

123.36363636363636